jecarrique/ros2-esp32-c3/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32c3"

# Partition table with enough space for micro-ROS + app
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Increase main task stack for micro-ROS + Wi-Fi
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# FreeRTOS tick rate
CONFIG_FREERTOS_HZ=1000

# Wi-Fi
CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP32_WIFI_DYNAMIC_TX_BUFFER_NUM=32

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Default ROS 2 / micro-ROS network configuration (can be overridden with
# idf.py menuconfig, see main/Kconfig.projbuild).
# These are placeholder values only - never commit real Wi-Fi credentials
# here. Override them locally via `idf.py menuconfig` (stored in the
# gitignored `sdkconfig` file) instead.
CONFIG_WIFI_SSID="myssid"
CONFIG_WIFI_PASSWORD="mypassword"
CONFIG_MICRO_ROS_AGENT_IP="192.168.1.100"
CONFIG_MICRO_ROS_AGENT_PORT=8888
